/**
 *放地址中的市名縣名和區名和鎮名
 */
var taiwan_citys = new Array("臺北市", "新北市", "臺中市", "臺南市", "高雄市", "基隆市", "新竹市", "嘉義市", "桃園縣", "新竹縣", "苗栗縣", "彰化縣", "南投縣", "雲林縣", "嘉義縣", "屏東縣", "宜蘭縣", "花蓮縣", "臺東縣", "澎湖縣", "金門縣", "連江縣");
//台北市
var c1 = new Array("臺北市", "中正區", "大同區", "中山區", "萬華區", "信義區", "松山區", "大安區", "南港區", "北投區", "內湖區", "士林區", "文山區");
//新北市
var c2 = new Array("新北市", "板橋區", "新莊區", "泰山區", "林口區", "淡水區", "金山區", "八里區", "萬里區", "石門區", "三芝區", "瑞芳區", "汐止區", "平溪區", "貢寮區", "雙溪區", "深坑區", "石碇區", "新店區", "坪林區", "烏來區", "中和區", "永和區", "土城區", "三峽區", "樹林區", "鶯歌區", "三重區", "蘆洲區", "五股區");
//臺中市
var c3 = new Array("臺中市", "中區", "東區", "南區", "西區", "北區", "北屯區", "西屯區", "南屯區", "太平區", "大里區", "霧峰區", "烏日區", "豐原區", "后里區", "東勢區", "石岡區", "新社區", "和平區", "神岡區", "潭子區", "大雅區", "大肚區", "龍井區", "沙鹿區", "梧棲區", "清水區", "大甲區", "外埔區", "大安區");
//臺南市
var c4 = new Array("臺南市", "中西區", "東區", "南區", "北區", "安平區", "安南區", "永康區", "歸仁區", "新化區", "左鎮區", "玉井區", "楠西區", "南化區", "仁德區", "關廟區", "龍崎區", "官田區", "麻豆區", "佳里區", "西港區", "七股區", "將軍區", "學甲區", "北門區", "新營區", "後壁區", "白河區", "東山區", "六甲區", "下營區", "柳營區", "鹽水區", "善化區", "大內區", "山上區", "新市區", "安定區");		
//高雄市
var c5 = new Array("高雄市", "楠梓區", "左營區", "鼓山區", "三民區", "鹽埕區", "前金區", "新興區", "苓雅區", "前鎮區", "小港區", "旗津區", "鳳山區", "大寮區", "鳥松區", "林園區", "仁武區", "大樹區", "大社區", "岡山區", "路竹區", "橋頭區", "梓官區", "彌陀區", "永安區", "燕巢區", "田寮區", "阿蓮區", "茄萣區", "湖內區", "旗山區", "美濃區", "內門區", "杉林區", "甲仙區", "六龜區", "茂林區", "桃源區", "那瑪夏區");	
//桃園市
//var taoyuan_city  		= new Array("");		
//基隆市
var c6 = new Array("基隆市", "仁愛區", "中正區", "信義區", "中山區", "安樂區", "暖暖區", "七堵區");		
//新竹市
var c7 = new Array("新竹市", "東區", "北區", "香山區");		
//嘉義市
var c8 = new Array("嘉義市", "東區", "西區");		
//桃園縣
var c9 = new Array("桃園縣", "桃園市", "中壢市", "平鎮市", "八德市", "楊梅市", "大溪鎮", "蘆竹鄉", "龍潭鄉", "龜山鄉", "大園鄉", "觀音鄉", "新屋鄉", "復興鄉");
//新竹縣
var c10 = new Array("新竹縣", "竹北市", "竹東鎮", "新埔鎮", "關西鎮", "新豐鄉", "峨眉鄉", "寶山鄉", "五峰鄉", "橫山鄉", "北埔鄉", "尖石鄉", "芎林鄉", "湖口鄉");		
//苗栗縣
var c11 = new Array("苗栗縣", "苗栗市", "通霄鎮", "苑裡鎮", "竹南鎮", "頭份鎮", "後龍鎮", "卓蘭鎮", "西湖鄉", "頭屋鄉", "公館鄉", "銅鑼鄉", "三義鄉", "造橋鄉", "三灣鄉", "南庄鄉", "大湖鄉", "獅潭鄉", "泰安鄉");		
//彰化縣
var c12 = new Array("彰化縣", "彰化市", "員林鎮", "和美鎮", "鹿港鎮", "溪湖鎮", "二林鎮", "田中鎮", "北斗鎮", "花壇鄉", "芬園鄉", "大村鄉", "永靖鄉", "伸港鄉", "線西鄉", "福興鄉", "秀水鄉", "埔心鄉", "埔鹽鄉", "大城鄉", "芳苑鄉", "竹塘鄉", "社頭鄉", "二水鄉", "田尾鄉", "埤頭鄉", "溪州鄉");	
//南投縣
var c13 = new Array("南投縣", "南投市", "埔里鎮", "草屯鎮", "竹山鎮", "集集鎮", "名間鄉", "鹿谷鄉", "中寮鄉", "魚池鄉", "國姓鄉", "水里鄉", "信義鄉", "仁愛鄉");		
//雲林縣
var c14 = new Array("雲林縣", "斗六市", "斗南鎮", "虎尾鎮", "西螺鎮", "土庫鎮", "北港鎮", "莿桐鄉", "林內鄉", "古坑鄉", "大埤鄉", "崙背鄉", "二崙鄉", "麥寮鄉", "臺西鄉", "東勢鄉", "褒忠鄉", "四湖鄉", "口湖鄉", "水林鄉", "元長鄉");		
//嘉義縣
var c15 = new Array("嘉義縣", "太保市", "朴子市", "布袋鎮", "大林鎮", "民雄鄉", "溪口鄉", "新港鄉", "六腳鄉", "東石鄉", "義竹鄉", "鹿草鄉", "水上鄉", "中埔鄉", "竹崎鄉", "梅山鄉", "番路鄉", "大埔鄉", "阿里山鄉");		
//屏東縣
var c16 = new Array("屏東縣", "屏東市", "潮州鎮", "東港鎮", "恆春鎮", "萬丹鄉", "長治鄉", "麟洛鄉", "九如鄉", "里港鄉", "鹽埔鄉", "高樹鄉", "萬巒鄉", "內埔鄉", "竹田鄉", "新埤鄉", "枋寮鄉", "新園鄉", "崁頂鄉", "林邊鄉", "南州鄉", "佳冬鄉", "琉球鄉", "車城鄉", "滿州鄉", "枋山鄉", "霧台鄉", "瑪家鄉", "泰武鄉", "來義鄉", "春日鄉", "獅子鄉", "牡丹鄉", "三地門鄉");	
//宜蘭縣
var c17	= new Array("宜蘭縣", "宜蘭市", "羅東鎮", "蘇澳鎮", "頭城鎮", "礁溪鄉", "壯圍鄉", "員山鄉", "冬山鄉", "五結鄉", "三星鄉", "大同鄉", "南澳鄉");		
//花蓮縣
var c18 = new Array("花蓮縣", "花蓮市", "鳳林鎮", "玉里鎮", "新城鄉", "吉安鄉", "壽豐鄉", "秀林鄉", "光復鄉", "豐濱鄉", "瑞穗鄉", "萬榮鄉", "富里鄉", "卓溪鄉");	
//臺東縣
var c19 = new Array("臺東縣", "臺東市", "成功鎮", "關山鎮", "長濱鄉", "海端鄉", "池上鄉", "東河鄉", "鹿野鄉", "延平鄉", "卑南鄉", "金峰鄉", "大武鄉", "達仁鄉", "綠島鄉", "蘭嶼鄉", "太麻里鄉");		
//澎湖縣
var c20 = new Array("澎湖縣", "馬公市", "湖西鄉", "白沙鄉", "西嶼鄉", "望安鄉", "七美鄉");		
//金門縣
var c21 = new Array("金門縣", "金城鎮", "金湖鎮", "金沙鎮", "金寧鄉", "烈嶼鄉", "烏坵鄉");		
//連江縣
var c22 = new Array("連江縣", "南竿鄉", "北竿鄉", "莒光鄉", "東引鄉");	

function init_city() {
	var init_city_string = "<option value=''>請選擇 縣/市</option>";
	
	for(var i = 0;i < taiwan_citys.length;i++) {
		init_city_string = init_city_string + "<option value='" + taiwan_citys[i] + "'>" + taiwan_citys[i] + "</option>";
	}
	
	return init_city_string;
}

function init_district(city) {
	var init_district_string = "<option value=''>請選擇 鎮/區</option>";
	var city_sum = new Array();

	city_sum.push(c1, c2, c3, c4, c5, c6, c7, c8, c9, c10, c11, c12, c13, c14, c15, c16, c17, c18, c19, c20, c21, c22);

	if(city == "") {
		return init_district_string;
	} else {
		for(var i = 0;i < city_sum.length;i++) {
			if(city == city_sum[i][0]) {
				for(var k = 1;k < city_sum[i].length;k++) {
					init_district_string = init_district_string + "<option value='" + city_sum[i][k] + "'>" + city_sum[i][k] + "</option>";
				}

				return init_district_string;
			} 
		}
	}
}